app/views/users/index.html.erb

SELECT "users".* FROM "users" WHERE (LOWER(username) LIKE '%sonountest%')
---
       Followers: <%= user.followers_count %>
       Follows: <%= user.following_by_type('User').size %>