app/views/users/show.html.erb

<li class="list-inline-item">
<h5 class="font-weight-bold mb-0 d-block"><%= @user.books.size %></h5><small class="text-muted">
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]