app/views/pages/home.html.erb

SELECT "books".* FROM "books" ORDER BY "books"."likes" ASC
---

<% Book.order(:likes).reverse().each do |book| %>