app/views/books/show.html.erb

<h2 class="capitolilibro">CAPITOLI</h2>
<% @book.chapters.each do |chapter| %>
---
SELECT "chapters".* FROM "chapters" WHERE "chapters"."book_id" = ?  [["book_id", 1]]


<%if Review.where(user_id:current_user.id,book_id:@book.id).empty?%>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]