app/controllers/books_controller.rb

  def show
    @book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @book = current_user.books.new(book_params)
    if @book.save
---
INSERT INTO "books" ("titolo", "trama", "tag", "genere", "created_at", "updated_at", "user_id", "cover_file_name", "cover_content_type", "cover_file_size", "cover_updated_at", "likes", "stato", "visibility") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def update
      @book = current_user.books.find(params[:id])
      if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "titolo" = ?, "trama" = ?, "tag" = ?, "genere" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["titolo", "New Test Book"], ["trama", "This is a new test book"], ["tag", "newtest"], ["genere", "non-fiction"], ["updated_at", "2023-08-26 15:26:06.539301"], ["id", 1]]

      def destroy
        @book = current_user.books.find(params[:id])
        #@book.users.clear
        @book.destroy
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]

        def set_test_user
          @current_user = User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]