app/controllers/pages_controller.rb

SELECT "books".* FROM "books"
---
  def home

    @books = Book.all